class IngredientResources {
  static const List<List<String>> ingredientList = [
    // 野菜・果実
    [
      'アスパラガス',
      '枝豆',
      'いんげん',
      'オクラ',
      'かぼちゃ',
      'キャベツ',
      'きゅうり',
      '小松菜',
      'ごぼう',
      'さつまいも',
      'じゃがいも',
      'タマネギ',
      'だいこん',
      'チンゲン菜',
      'とうもろこし',
      'トマト',
      'ナス',
      'ニラ',
      'にんじん',
      'ネギ',
      '白菜',
      'パプリカ',
      'ピーマン',
      'ブロッコリー',
      'ほうれん草',
      'もやし',
      'レタス',
      'れんこん'
    ],

    // 水産品
    ['鮭', 'サバ', 'マグロ', 'イワシ', 'タコ', 'エビ', 'カニ', 'ホタテ', 'カキ', 'ウナギ'],

    // 畜産品
    [
      '豚ひき肉',
      '鶏むね肉',
      '牛ひき肉',
      '豚バラ肉',
      'ベーコン',
      'ハム',
      'ソーセージ',
      'サラミ',
      '鶏もも肉',
      'ラム肉'
    ],

    // 穀物
    ['ごはん', '玄米', 'パン', 'うどん', 'そば', 'パスタ', 'もち米', 'オートミール', 'きび', 'あわ'],

    // 加工品
    [
      '豆腐',
      '納豆',
      '厚揚げ',
      '油揚げ',
      'チーズ',
      'ヨーグルト',
      'バター',
      '生クリーム',
      '缶詰トマト',
      'ソーセージ'
    ],
  ];
}
